<a href="https://colab.research.google.com/github/topchaebol/006762/blob/master/0704(2)_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%A0%84%EC%B2%98%EB%A6%AC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1. 데이터 프리 프로세싱
## 1) 미싱 데이터처리

In [2]:
data = """\
country, age, salary
France, 44, 72000
Spain, 27, 48000
Germany, 30, 54000
Spain, 38, 61000
Germany, 40, 
France, 35, 58000
Spain, , 52000
France, 48, 79000
Germany, 50, 83000
France, 37, 67000
"""

with open("data.csv", "w") as f:
  f.write(data) 
import pandas as pd
df = pd.read_csv("data.csv")
df

   country  age  salary
0   France   44   72000
1    Spain   27   48000
2  Germany   30   54000
3    Spain   38   61000
4  Germany   40
5   France   35   58000
6    Spain        52000
7   France   48   79000
8  Germany   50   83000
9   France   37   67000

In [3]:
df.values

array([['France', ' 44', ' 72000'],
       ['Spain', ' 27', ' 48000'],
       ['Germany', ' 30', ' 54000'],
       ['Spain', ' 38', ' 61000'],
       ['Germany', ' 40', ' '],
       ['France', ' 35', ' 58000'],
       ['Spain', ' ', ' 52000'],
       ['France', ' 48', ' 79000'],
       ['Germany', ' 50', ' 83000'],
       ['France', ' 37', ' 67000']], dtype=object)